# Adryell Alexandre Campos Medeiros

# SQL - Análise de Dados

## Comandos Básicos

### Select

O comando 'select' tem como propriedade selecioinar as colunas das tabelas referenciadas a este.<br>
Exemplo de sintaxe: select coluna_1, coluna_2, coluna_3 from schema_1.tabela_1<br>
                    select * from schema_1.tabela_1 (o * é utilizado para selecionar todas as colunas)

### Distinct
O comando 'distinct' serve para remover linhas duplicadas e mostrar apenas linhas distintas, um comando de bastante uso na exploração dos dados.<br>
Exemplo de sintaxe: select distinct coluna1, coluna2, coluna3<br> 
                    from schema_1.tabela_1

### Where
O comando 'where' realiza um filtro nos dados através de uma condição, no qual são retornados os dados apenas onde a condição é verdadeira.
Exemplo de sintaxe: select coluna_1, coluna_2, coluna_3<br>
                    from schema_1.tabela_1<br>
                    where condicao = true


### Order by
O comando 'order by' ordena uma seleção de acordo com as regras definidas no script. <br>
Exemplo de sintaxe: select coluna_1, coluna_2, coluna_3<br>
                    from schema_1.tabela_1<br>
                    where condição_x=true<br>
                    order by coluna_1

### Limit
O comando 'limit' seleciona apenas as N linhas da base de dados.<br>
Exemplo de sintaxe: select coluna_1, coluna_2, coluna_3<br>
                    from schema_1.tabela_1<br>
                    limit N

## Operadores

### Operadores Aritméticos
Servem para realizar operações matemáticas entre colunas, tendo uma vasta utilização na criação de colunas calculadas.<br>
Exemplo de sintaxe: select coluna_1, coluna_2, (current_date - coluna_2)/365 as "idade"<br>
                    from schema_1.tabela_1

### Operadores de Comparação
Suas funções são comparar dois valore retornando 'TRUE' ou 'FALSE', muitas das vezes utilizado em conjunto com a função 'WHERE' para filtrar linhas de uma seleção.<br>
Exemplo de sintaxe: select coluna_1, coluna_2, coluna_3,<br>
                	(coluna_3 = 'X') as coluna_3_X<br>
                    from schema_1.tabela_1

### Operadores Lógicos
Tem como função unir expressões simples em uma expressão composta.<br>
Exemplo de sintaxe: select *<br>
                    from schema_1.tabela_1<br>
                    where coluna_1 between 100000 and 200000

## Funções Agregadas

### Funções de Agregações
Servem para executar operações aritmética nos registros de uma coluna, vale ressaltar que as funções agregadas não computam as células vazias (NULL) como zero.<br>
Exemplo de sintaxe: select min(coluna_1), max(coluna_2), avg(coluna_3)<br>
                    from schema_1.tabela_1

### Group By
O comando 'group by' é utilizado para agrupar registros semelhantes de uma coluna, onde normalmente é utilizado em conjunto com funções de agregrações.<br>
Exemplo de sintaxe: select coluna_1, count(*) as contagem<br>
                    from schema_1.tabela_1<br>
                    group by coluna_1<br>
                    order by contagem

### Having
O comando 'having' serve para realizar um filtro nas linhas de seleção por uma coluna agrupada.<br>
Exemplo de sintaxe: select coluna_1, count(*)<br>
                    from schema_1.tabela_1<br>
                    group by coluna_1<br>
                    having count(*) > 100

## Joins

O comando 'JOIN' corresponde a união de tabelas, onde é possível acessar em uma busca os dados em diferentes tabelas que possuam uma conexão entre si através de chaves extrangeiras, ou seja, utilizado para combinar duas ou mais tabelas. Existem diferentes tipos de união de tabelas, sendo elas:<br>

### Left Join:
Os dados de busca serão todos referentes a tabela esquerda e os dados de interseção entre as duas tabelas. Observação: destaca-se que a tabela esquerda é a que foi declarada primeira.<br>
Exemplo de sintaxe: select t1.coluna_1, t1.coluna_2, t2.coluna_2<br>
                    from schema_1.tabela_1 t1<br>
                    left join schema_1.tabela_2 t2 on t1.coluna_1cpf = t2.coluna_2

### Inner Join:
Os dados selecionados serão apenas os dados da interseção entre as duas tabelas.
Exemplo de sintaxe: select t1.coluna_1, t1.coluna_2, t2.coluna_2<br>
                    from schema_1.tabela_1 t1<br>
                    inner join schema_1.tabela_2 t2 on t1.coluna_1cpf = t2.coluna_2

### Right Join:
De maneira semelhante ao comando 'LEFT JOIN' os dados selecionados serão todos presentes na tabela a dirita e os que possuem interseção entre as duas tabelas. Oservação: destaca-se que a tabela direita é a que foi declarada por último.
Exemplo de sintaxe: select t2.coluna_1, t1.coluna_2, t2.coluna_2<br>
                    from schema_1.tabela_1 t1<br>
                    right join schema_1.tabela_2 t2 on t1.coluna_1cpf = t2.coluna_2

### Full Join:
Serão selecionados todos os dados de ambas as tabelas.
Exemplo de sintaxe: select t1.coluna_1, t1.coluna_2, t2.coluna_2<br>
                    from schema_1.tabela_1 t1<br>
                    full join schema_1.tabela_2 t2 on t1.coluna_1cpf = t2.coluna_2

**Observação:** O comando 'JOIN' sozinho corresponde ao comando 'INNER JOIN'.

## Unions

O comando 'UNION' serve para unir duas tabelas, desde que as tabelas possuam mesma quantidade de colunas e mesto tipo de dados. Onde esxistem duas formas de união, sendo elas:

### Union All:

Não remove as linhas duplicadas, sendo computacionalmente masi leve.<br>
Exemplo de sintaxe: select coluna_1, coluna_2<br>
                    from schema_1.tabela_1<br>
                    union all<br>
                    select coluna_3, coluna_4<br> 
                    from schema_2.tabela_2


### Union:

Remove as linhas duplicadas, sendo computacionalmente mais pesado.<br>
Exemplo de sintaxe: select coluna_1, coluna_2<br>
                    from schema_1.tabela_1<br>
                    union<br>
                    select coluna_3, coluna_4<br> 
                    from schema_2.tabela_2

## Subqueries

As subqueries servem para consultar dados de outras consultas, ou seja, é uma consulta de forma aninhada, se tratando de um consulta dentro de outra consulta. Os dados são passados da consulta mais interna para a mais externa. Alguns tipos de subqueries são:

### Where:
A subquery no comando 'WHERE' ocorre quando são passados parâmetros neste comando ao realizar a query, destaca que para que funcione deve retornar apenas um valor.

### With:
A subquery no com o comando 'WITH' corresponde a criação de uma outra query, muitas das vezes uma tabela, que será auxiliadora ou que resolverá parte de um problema para que esse possa ser continuado em outra query.

### From:
A subquery no comando 'FROM' ocorre quando são passados parâmetros neste comando ao realizar a query, neste caso recomenda-se a utilização do comando 'WITH' para tentar resolver o problema. Subqueries no comando 'FROM' dificultam a legibilidade por isso não são muito recomendadas.

### Select:
A subquery no comando 'SELECT' ocorre quando são passados parâmetros neste comando ao realizar a query, destaca-se que para que funcione a subquerie deve retornar apenas um valor.

## Tratamento de dados

Os tratamentos de dados são utilizados para que seja realizada uma conversão nos dados e estes estejam de maneira que sejam aceitas póssíveis buscas, passagem de parâmetros, operações com os dados, entre outros. Existem alguns tratamentos em específico, sendo estes: <br>

### Conversão de unidades:
A conversão de unidades é necessária quando se deseja realizar uma operação com alguns dados em específicos, mas estes encontram-se em unidades diferentes das necessárias. Podem ser utilizados o comando '::' ou 'CAST ()'.<br>
Exemplo de sintaxe:<br>
>                   select nome_coluna::date
>                   from nome_tabela
>                  
>                   select cast(nome_coluna as date)
>                   from nome_tabela

### Tratamento geral:
O tratamento geral de dados é recomendado quando é necessário realizar tratamentos específicos na base de dados. Alguns métodos utilizados são o comando 'COALECE()' e 'CASE WHEN'.

### Tratamento de texto:
O tratamento de texto ocorre quando é necessário realizar tratamentos específicos na base de dados relacionados com os textos. Alguns métodos utilizados são os comandos 'LOWER()', 'REPLACE()', 'UPPER()', 'TRIM()'.<BR>
Exemplo de sintaxe: <br>
>                 select lower ('EXEMPLO') = 'exemplo'
>                 select replace ('Exemplo', 'Exemplo', 'Exemplos') = 'Exemplos'
>                 select upper ('exemplo') = 'EXEMPLO'
>                 select trim ('     Exemplo    ') = 'Exemplo' --Remove os espaços das extremidades

### Tratamento de data:
O tratamento de datas é necessário em casos que precisa realizar operações com datas. Existem alguns métodos sendo eles:<br>
-         'INTERVAL': utilizado para somar datas na unidade desajada, como default o ambiente entende que a unidade a ser calculada é o dia.
          Exemplo de sintaxe: select (current_date + interval '10 weeks')::date
-         'DATE_TRUNC': é utilizado para resumir (truncar) uma data ao início de um período.
          Exemplo de sintaxe: select date_trunc('month', coluna_data)::date as coluna_mes
-         'EXTRACT': utilizado para extrair unidades de uma data.
          Exemplo de sintaxe: select extract('dow' from coluna_data) as dia_da_semana
-         Operadores Aritméticos: outra maneira de realizar o tratamento de datas é através de operadores aritméticos.

### Funções:
As funções tem como objetivo e funcionalidade criar comandos personalizados de scripts usados recorrentemente, dos quais não estão inseridos por padrão no ambiente de desenvolvimento.<br>
Exemplo de sintaxe:<br>
create function datediff(unidade varchar, data_inicial date, data_final date)
returns integer
language sql

as

$$

	 select
	 	 case
			 when unidade in ('d', 'day', 'days') then (data_final - data_inicial)
			 when unidade in ('w', 'week', 'weeks') then (data_final - data_inicial)/7
			 when unidade in ('m', 'month', 'months') then (data_final - data_inicial)/30
			 when unidade in ('y', 'year', 'years') then (data_final - data_inicial)/365
			 end as diferenca

$$

select datediff('years', '2021-02-04', current_date)

## Manipulação de Tabelas

### Create:
O comando 'CREATE ()' é utilizado na criação de tabelas, através de uma query específica ou a partir do zero.<br>
Exemplo de sintaxe:<br>
create table schema_1.tabela_1(<br>
    coluna_1 varchar primary key,<br>
    coluna_2 integer<br>
); --Do zero

select coluna_1, (coluna_3 - coluna_2) as coluna_4<br>
	into schema_1.tabela_2
from schema_1.tabela_1

### Drop:
O comando 'DROP' é utilizado para realizar a exclusão de tabelas ou funções.<br>
Exemplo de sintaxe:<br>
drop table schema_1.tabela_1

### Insert:
O comando 'INSERT' é utilizado para realizar a inserção de linhas em uma tabela.<br>
Exemplo de sintaxe:<br>
insert into scheam_1.tabela_1 (coluna_1, coluna_2) values (x, y)

### Update:
O comando 'UPDATE' é utilizado para atualizar as linhas de uma tabela.<br>
Exemplo de sintaxe:<br>
update schema_1.tabela_1<br>
set coluna_1 = 'exemplo'
where coluna_2 = 'EXEMPLO'

### Delete:
O comando 'DELETE' é utilizado para deletar as linhas de uma tabela.<br>
Exemplo de sintaxe:<br>
delete from schema_1.tabela_1<br>
where coluna_1 = 'exemplo'
or coluna_2 = 'EXEMPLO'

### Alter Table:
O comando 'ALTER TABLE' é utilizado para realizar qualquer alteração em colunas de uma tabela. Sendo algumas dessas alterações adição de colunas ('ADD NOME_COLUNA'), tipo de coluna ('ALTER COLUMN NOME_COLUNA TYPE VARCHAR'), renomear a coluna ('RENAME COLUMN NOME_COLUNA TO NOME_COLUNA_1'), deletar coluna ('DROP COLUMN NOME_COLUNA').<br>
Exemplo de sintaxe:<br>
alter table schema_1.tabela_1<br>
rename column coluna_1 to coluna_2